---
type: ExternallyTaggedNonBReps
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExternallyTaggedNonBReps

`Autodesk.Revit.DB.ExternallyTaggedNonBReps` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternallyTaggedNonBReps | 2024 | `public ExternallyTaggedNonBReps ()` |
| Method | Add | 2024 | `public void Add ( ExternallyTaggedNonBRep geometry )` |
| Method | CanAddExternallyTaggedNonBRep | 2024 | `public bool CanAddExternallyTaggedNonBRep ( ExternallyTaggedNonBRep geometry )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |